swagger/src/Catalogs/ИсточникДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ИсточникДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/ИсточникДанных/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Представление = "Источник " + Данные.Наименование;
КонецПроцедуры

Функция ВыполнитьИсточник(ИсточникДанных, ВыполнитьКакПакет = Ложь) Экспорт 
	Результат = Неопределено;
	
	ИсточникОб = ИсточникДанных.ПолучитьОбъект();
	Если Ложь Тогда
		ИсточникОб = Справочники.ИсточникДанных.СоздатьЭлемент()
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИсточникОб.ТекстЗапроса;
	
	Для каждого Параметр Из ИсточникОб.Параметры Цикл
		Если ПустаяСтрока(Параметр.Выражение) Тогда
			Запрос.УстановитьПараметр(Параметр.Параметр, Параметр.Значение);
		Иначе
			ЗначениеПараметра = Неопределено;
			Выражение = "ЗначениеПараметра = " + Параметр.Выражение + ";";
			Выполнить Выражение;
			Запрос.УстановитьПараметр(Параметр.Параметр, ЗначениеПараметра);
		КонецЕсли;
	КонецЦикла;
	
	//Общие праметры
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Для каждого Параметр Из ВходящиеПараметры Цикл
	//	Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	//КонецЦикла;
	
	Если ВыполнитьКакПакет Тогда
		Результат = Запрос.ВыполнитьПакет();
	Иначе
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	//Результат = РезультатЗапроса.Выбрать();
	
	Возврат Результат;
КонецФункции
